core/app/Controllers/Home.php

SELECT *
FROM `sekolah`
---
    public function index()
    {
        $this->model    = new ModelSekolah();
        $data_sekolah   = $this->model->findAll();